

from enum import Enum


class ComonStatusCodeEnum(Enum):
    
    # ###################通用代码段 99~90###################
    # 登录99
    登录失败 = "999900"
    用户名或密码错误 = "999901"
    用户未登录 = "999902"
    TOKEN无效 = "999903"
    用户不存在 = "999904"
    
    # 用户操作 98
    用户创建失败 = "999800"
    
    
    # ###################权限模块代码 89###################
    # rsa加密代码 00
    RSA加密失败 = "890000"
    
    # rsa解密代码 01
    RSA解密失败 = "890100"
    
    # AES加密代码 02
    AES加密失败 = "890200"
    
    # AES解密代码 03
    AES解密失败 = "890300"
    
    # MD5加密代码 04
    MD5加密失败 = "890400"
    
    # AES加密代码 04
    AES2加密失败 = "890500"
    
    # AES解密代码 06
    AES2解密失败 = "890600"
